


const courses = [
  {
    id:"theater",
    title: "תיאטרון",
    subtitle: "סדנאות תיאטרון ואימפרוביזציה חוויותיות",
    duration: " סדנה מלאה - 4 שעות ",
    taste:"מפגש טעימות - 90 דק'",
    personalDuration:'ניתן ליצור תוכנית בהתאמה אישית לרצף מפגשים.',
    content:
      "יסודות התיאטרון, עבודה על : מקום, עמידה מול קהל, עבודה עם פרטנר ובקבוצה , ריכוז והקשבה, הבעה משחקית דרך:  תנועה, מוסיקה, קול ודיבור, רגשות, בניית דמויות ועוד. המטרה היא לפתח אצל התלמידים יכולת ביטוי, הבעת רגשות, עבודה בקבוצה, דמיון ויצירתיות באמצעות כלים ומשחקים תיאטרלים.",
    ages: "לתלמידי לכיתות ג'-יב",
    img:"https://res.cloudinary.com/explority/image/upload/c_scale,h_242/v1558028074/peter-lewicki-411606-unsplash_qpawrl.jpg"
  },
  {
    id:"thinkcreative",
    title:"חשיבה יצירתית",
    subtitle:"סדנה חוויתית לשבירת תבניות",
    duration: " סדנה מלאה - 4 שעות ",
    taste:"מפגש טעימות - 90 דק'",
    personalDuration:'ניתן ליצור תוכנית בהתאמה אישית לרצף מפגשים.',
    content:"המשתתפים יקבלו כלים וטיפים לפיתוח החשיבה היצירתית שלהם באמצעות תרגילי חשיבה, פתרון בעיות, אילתור ומשחק. התלמידים יעברו פעילויות המאתגרות ומפתחות את החשיבה היצירתית ויגיעו להבנה שזוהי יכולת הניתנת לפיתוח ויישום בכל תחומי החיים.",
    ages: "לתלמידי כיתות ג'-יב",
    purpose:"לעודד חשיבה 'מחוץ לקופסה' ולהוכיח שקיימות אפשרויות רבות גם למצבים שנראים על פניהם בעלי פתרון אחד או בלתי פתירים בעליל.    המשתתפים מתבקשים להשתמש בדמיון ולהציג דרכים יצירתיות לפתרון באמצעות חידות חשיבה ובאמצעות כלי התיאטרון כגון: אלתור, תרגילי תיאטרון, משחקי תפקידים ועוד.",
    img:"https://res.cloudinary.com/explority/image/upload/c_scale,h_250/v1558028088/laurenz-kleinheider-426386-unsplash_lj18ej.jpg"
  },
  {
    id:"bodylanguage",
    title: "שפת גוף",
    subtitle: "להבנה עמוקה לשפת הגוף",
    duration: " סדנה מלאה - 4 שעות ",
    taste:"מפגש טעימות - 90 דק'",
    personalDuration:'ניתן ליצור תוכנית בהתאמה אישית לרצף מפגשים.',
    content:
      "רוב התקשורת בין בני האדם מתקיימת באמצעות שפת הגוף ולא באמצעות הדיבור. רובנו מסגירים את התחושות שלנו כל הזמן בהתנהלות היום-יומית, באופן לא מודע. למרות שאנחנו מדברים כל הזמן, המידע המעניין באמת מועבר באמצעים לא מילוליים: האופן בו אנחנו מתלבשים, היציבה שלנו, הבעות הפנים, קשר העין שאנחנו יוצרים או לא יוצרים, תנועות היד, הזרוע והרגל, מתח השרירים, המרחב האישי שאנחנו שומרים וכדומה.",
      ages: "לתלמידי כיתות ג'-יב",
    img:'https://res.cloudinary.com/explority/image/upload/c_scale,h_250/v1558028065/jessica-da-rosa-1426489-unsplash_z26a8x.jpg'
  },
  {
    id:"methods",
    title: "מתודות",
    subtitle: "העברת מסרים בצורה נכונה",
    duration: " סדנה מלאה - 4 שעות ",
    taste:"מפגש טעימות - 90 דק'",
    personalDuration:'ניתן ליצור תוכנית בהתאמה אישית לרצף מפגשים.',
    purpose:"הבנת חשיבות השימוש במתודות, חשיפה למגוון דרכים להעברת מסר והתאמת המתודה לסוג הקבוצה. שהתלמיד יבין שיש לקחת בחשבון מדדים רבים ומשתנים בהעברת מסרים כגון: מטרת המרצה\מדריך גיל הקהל, מיומנות נדרשת של המרצה\מדריך, תחומי עניין של הקהל, מקום ההרצאה, תנאי השטח , גודל ומבנה (כמות, בנים/בנות) התאמה לתוכן ולמסר של הפעולה, עזרים, תקציב ועוד.הסדנה משלבת מתודות מגוונות של עבודה אישית, עבודה בקבוצה, משחקי תיאטרון, הצגה ודיון.",
    content:
     " הכרות והתנסות במגוון מתודות, כלים וטכניקות להעברת מסרים מעולם התיאטרון, האמנות, המוזיקה, הקולנוע ועוד.",
    ages: "לתלמידי כיתות ה'-יב",
    img:"https://res.cloudinary.com/explority/image/upload/c_scale,h_250/v1558028127/priscilla-du-preez-697316-unsplash_x084tt.jpg"
  },
  {
    id:"objects",
    title: " חפצים",
    subtitle: "",
    duration: " סדנה מלאה - 4 שעות ",
    taste:"מפגש טעימות - 90 דק'",
    personalDuration:'ניתן ליצור תוכנית בהתאמה אישית לרצף מפגשים.',
    content:
      "לכל החפצים סביבנו ביום יום יש תפקיד מאוד מסוים. אך מה קורה שאנו שוברים את המוסכמה ומשתמשים בדמיון שלנו ולמציאת שימושים נוספים, מעניינים, מצחיקים למגוון של חפצים? במסגרת עולם התיאטרון אנו יכולים לעוף עם הדמיון, להמציא סיפורים וליצור עולם עשיר על הבמה אם אנחנו מסכימים להסתכל קצת אחרת על מה שמסביבנו. סדנה חווייתית שמשלבת הרבה תרגילי דימיון ואימפרוביזציה, בה התלמידים מוצאים שימושים חדשים ומעניינים לחפצים מוכרים ולומדים להסתכל על דברים מכמה זוויות. הסדנה משלבת עבודה אישית וקבוצתית. ",
    ages: "לתלמידי כיתות ג'-יב",
    img:"https://res.cloudinary.com/explority/image/upload/c_scale,h_250/v1558028071/taner-ardali-807-unsplash_trv3wy.jpg",
  },
  {
    id:"caracters",
    title: " דמויות",
    subtitle: "",
    duration: " סדנה מלאה - 4 שעות ",
    taste:"מפגש טעימות - 90 דק'",
    personalDuration:'ניתן ליצור תוכנית בהתאמה אישית לרצף מפגשים.',
    content:
      "איך אני ממציא דמות? אילו כלים עומדים בפני שחקן כאשר הוא צריך ליצור דמות? איך אני מוצא את הקול שלה? את הלבוש שלה? אילו תכונות אופי יש לה? איך היא מגיבה במצבים מסויימים?  סדנה חוויתית שנותנת כלים מגוונים לבניית דמויות. המטרה שהתלמיד יבין שלכל דמות יש תכונה , מאפינים מאד ספציפיים ומודגשים וידע להביא אותם לידי ביטוי. בסדנה מתנסים בבנית דמויות מהפנים לחוץ ומהחוץ לפנים",
    ages: "לתלמידי כיתות ג'-יב",
    img:"https://res.cloudinary.com/explority/image/upload/c_scale,h_250/v1558028070/steven-libralon-570406-unsplash_ytvqxv.jpg",
  }
];
function getCourseById(id){
  return new Promise((resolve, reject) => {
    const course = courses.find( course => course.id === id)
    course ? resolve(course) : reject(`course id ${id} not found!`);
  })
}
function getCourses(){
    return courses;
}
export default{
    getCourses,getCourseById
}