const reviews = [
  {
    from: "ורד, רכזת חברתית, תיכון ירושלים.",
    txt: "  אהובה יקרה, מהשיחה הראשונה איתך ידעתי שיהיה מדהים. כיף לעבוד איתך את מקסימה ומלאת אנרגיות. שוב תודה על ערב מושלם."
  },
  {
    from: "ריטה - מנהלת בית הספר יסודי ,מודיעין",
    txt: "כמו  החלילן מהמלין סחפת את כל התלמידים אחרייך. הבאת אלינו שמחה, אהבה, ואנרגיות ... ויצרת מופע מרגש ומקסים"
  },
  {
    from: "בתי, מחנכת ביהס יסודי מודיעין.",
    txt: "את ענקית!! תותחית על! תודה רבה!!."
  },
  {
    from: "עדן , תלמידה, חטיבת ביניים, סדנת תיאטרון",
    txt: "היה כיף, היה מרגש, למדתי, התבגרתי , השתנתי, הבנתי איך לתעל את הרגשות שלי החוצה.  היה פשוט מדהים!"
  },
  {
    from: "רביד - תלמידה ,חטיבת ביניים",
    txt: " הכרתי חברות חדשות ,מורה נפלאה והזדמנויות לחלוק את הכישרון שלי ...ראיתי למה אני מסוגלת ולמדתי לאהוב את עצמי "
  }
  
];
function getReviews() {
  return reviews;
}
function getReview(idx) {
  if (idx > -1 && idx < reviews.length) return reviews[idx];
  else return "not cool man";
}
export default {
  getReviews,
  getReview
};
